blockMeshDict/Circular Tube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// blockMeshDict for Circular Tube
convertToMeters 1;

R 0.5; // Radius of Wire
r 5; // Radius of Tube
cell #calc "$R*30";
lcell #calc "$r*50";

radAngle #calc "degToRad(45)";  //convert angle to radians
a #calc "$R*sin($radAngle)";   //Point in curve R sin angle
r1 #calc "$r+$a";
r2 #calc "$r-$a";
p1 #calc "$r1*sin($radAngle)";
p2 #calc "$r2*sin($radAngle)";
p3 #calc "$r+$R";
p4 #calc "$r-$R";

vertices
(
    (#calc "-1.0*$r1" 0 #calc "-1.0*$a")
    (#calc "-1.0*$r2" 0 #calc "-1.0*$a")
    (#calc "-1.0*$r2" 0 $a)
    (#calc "-1.0*$r1" 0 $a)

    (0 $r1 #calc "-1.0*$a")
    (0 $r2 #calc "-1.0*$a")
    (0 $r2 $a)
    (0 $r1 $a)

    ($r1 0 #calc "-1.0*$a")
    ($r2 0 #calc "-1.0*$a")
    ($r2 0 $a)
    ($r1 0 $a)

    (0 #calc "-1.0*$r1" #calc "-1.0*$a")
    (0 #calc "-1.0*$r2" #calc "-1.0*$a")
    (0 #calc "-1.0*$r2" $a)
    (0 #calc "-1.0*$r1" $a)

);

blocks
(
    hex (0 1 5 4 3 2 6 7) ($cell $lcell $cell) simpleGrading (1 1 1)
    hex (4 5 9 8 7 6 10 11) ($cell $lcell $cell) simpleGrading (1 1 1)
    hex (8 9 13 12 11 10 14 15) ($cell $lcell $cell) simpleGrading (1 1 1)
    hex (12 13 1 0 15 14 2 3) ($cell $lcell $cell) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (#calc "-1.0*$r" 0 #calc "-1.0*$R")
    arc 1 2 (#calc "-1.0*$p4" 0 0)
    arc 2 3 (#calc "-1.0*$r" 0 $R)
    arc 3 0 (#calc "-1.0*$p3" 0 0)

    arc 4 5 (0 $r #calc "-1.0*$R")
    arc 5 6 (0 $p4 0)
    arc 6 7 (0 $r $R)
    arc 7 4 (0 $p3 0)

    arc 8 9 ($r 0 #calc "-1.0*$R")
    arc 9 10 ($p4 0 0)
    arc 10 11 ($r 0 $R)
    arc 11 8 ($p3 0 0)

    arc 12 13 (0 #calc "-1.0*$r" #calc "-1.0*$R")
    arc 13 14 (0 #calc "-1.0*$p4" 0)
    arc 14 15 (0 #calc "-1.0*$r" $R)
    arc 15 12 (0 #calc "-1.0*$p3" 0)

    arc 0 4 (#calc "-1.0*$p1" $p1 #calc "-1.0*$a")
    arc 1 5 (#calc "-1.0*$p2" $p2 #calc "-1.0*$a")
    arc 2 6 (#calc "-1.0*$p2" $p2 $a)
    arc 3 7 (#calc "-1.0*$p1" $p1 $a)

    arc 4 8 ($p1 $p1 #calc "-1.0*$a")
    arc 5 9 ($p2 $p2 #calc "-1.0*$a")
    arc 6 10 ($p2 $p2 $a)
    arc 7 11 ($p1 $p1 $a)

    arc 12 0 (#calc "-1.0*$p1" #calc "-1.0*$p1" #calc "-1.0*$a")
    arc 13 1 (#calc "-1.0*$p2" #calc "-1.0*$p2" #calc "-1.0*$a")
    arc 14 2 (#calc "-1.0*$p2" #calc "-1.0*$p2" $a)
    arc 15 3 (#calc "-1.0*$p1" #calc "-1.0*$p1" $a)

    arc 8 12 ($p1 #calc "-1.0*$p1" #calc "-1.0*$a")
    arc 9 13 ($p2 #calc "-1.0*$p2" #calc "-1.0*$a")
    arc 10 14 ($p2 #calc "-1.0*$p2" $a)
    arc 11 15 ($p1 #calc "-1.0*$p1" $a)
);

boundary
(    
    Walls
    {
        type wall;
        faces
        (
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
